{
  "start": {
    "description": "You awaken inside a dim, concrete hallway. The lights above flicker violently. A low humming echoes through the walls. A cold draft crawls across your skin.\n\nAhead of you lies a rusted metal door. Behind you, darkness stretches endlessly.",
    "commands": {
      "help": {
        "response": "Available commands: look, forward, back",
        "next": "start"
      },
      "look": {
        "response": "The hallway is abandoned... but something on the ground catches your eye — a small metal object glinting in the flickering light. You pick it up.",
        "next": "start",
        "addItem": ["strange_key"]
      },
      "forward": {
        "response": "You push the rusted metal door — it screeches open, revealing a stairwell spiraling downward.",
        "next": "stairwell"
      },
      "back": {
        "response": "You step back… the darkness seems to breathe, swallowing all sound.",
        "next": "darkness"
      }
    },
    "end": "false"
  },

  "stairwell": {
    "description": "The stairwell is drenched in shadow. Each step creaks under your weight. A red EXIT sign flickers far below, but a whisper floats from a side doorway halfway down.",
    "commands": {
      "help": {
        "response": "Available commands: down, side, listen",
        "next": "stairwell"
      },
      "down": {
        "response": "You descend cautiously. The EXIT sign glows brighter… until it abruptly shuts off.",
        "next": "exit_hall"
      },
      "side": {
        "response": "You open the side door — inside, something metallic glints on a dusty table. You take it without thinking.",
        "next": "storage_room",
        "addItem": ["rusty_knife"]
      },
      "listen": {
        "response": "You hold still. The whisper forms words: 'Don't look behind you…'",
        "next": "stairwell"
      }
    },
    "end": "false"
  },

  "storage_room": {
    "description": "The room is cramped, filled with old broken machinery and shattered light fixtures. A foul smell leaks from a vent.",
    "commands": {
      "help": {
        "response": "Available commands: inspect vent, leave",
        "next": "storage_room"
      },
      "inspect vent": {
        "response": "You kneel to inspect the vent — a skeletal hand suddenly drops out and lands beside you… clutching a torn journal page.",
        "next": "storage_room",
        "addItem": ["journal_page"]
      },
      "leave": {
        "response": "You step back into the stairwell, shaken.",
        "next": "stairwell"
      }
    },
    "end": "false"
  },

  "exit_hall": {
    "description": "You reach a broken corridor. Emergency lights pulse red. Blood smears trail across the walls toward a collapsed section of ceiling.",
    "commands": {
      "help": {
        "response": "Available commands: follow blood, left, right",
        "next": "exit_hall"
      },
      "follow blood": {
        "response": "You follow the trail and notice a battered tool belt hanging from a broken pipe. You take what you can.",
        "next": "collapsed_corridor",
        "addItem": ["crowbar"]
      },
      "left": {
        "response": "You turn left and hear something huge dragging metal deeper inside.",
        "next": "machine_room"
      },
      "right": {
        "response": "A dead-end… but a backpack slumps against the wall. Inside, you find something helpful.",
        "next": "exit_hall",
        "addItem": ["flashlight"]
      }
    },
    "end": "false"
  },

  "collapsed_corridor": {
    "description": "The ceiling has collapsed, blocking the path. But a large crack splits the wall — something shuffles inside the darkness of that narrow space.",
    "commands": {
      "help": {
        "response": "Available commands: use crowbar, call out",
        "next": "collapsed_corridor"
      },
      "use crowbar": {
        "response": "You wedge the crowbar into the cracked wall — the stone gives way, revealing a hidden maintenance tunnel.",
        "next": "tunnel"
      },
      "call out": {
        "response": "You call into the crack… the shuffling stops… then moves rapidly toward you.",
        "next": "death"
      }
    },
    "end": "false"
  },

  "machine_room": {
    "description": "You enter a massive industrial chamber filled with broken generators and hanging chains. Something metallic is breathing in the dark.",
    "commands": {
      "help": {
        "response": "Available commands: explore, run",
        "next": "machine_room"
      },
      "explore": {
        "response": "You move between the generators — finding a glowing battery pack on the floor. You pocket it.",
        "next": "machine_room",
        "addItem": ["battery_pack"]
      },
      "run": {
        "response": "You sprint away — chains rattle violently behind you.",
        "next": "exit_hall"
      }
    },
    "end": "false"
  },

  "tunnel": {
    "description": "The maintenance tunnel is cramped, damp, and reeks of mold. But ahead, you see a faint white light.",
    "commands": {
      "help": {
        "response": "Available commands: forward, back",
        "next": "tunnel"
      },
      "forward": {
        "response": "You crawl toward the light… only to find a locked hatch.",
        "next": "hatch"
      },
      "back": {
        "response": "You return to the collapsed corridor.",
        "next": "collapsed_corridor"
      }
    },
    "end": "false"
  },

  "hatch": {
    "description": "The hatch is sealed shut with a heavy lock. A symbol engraved on it matches the strange key you found earlier.",
    "commands": {
      "help": {
        "response": "Available commands: use key, knock",
        "next": "hatch"
      },
      "use key": {
        "response": "You insert the strange key — the hatch unlocks with a thunderous clang. A blinding light floods the tunnel.",
        "next": "ending"
      },
      "knock": {
        "response": "Something knocks back. Hard.",
        "next": "hatch"
      }
    },
    "end": "false"
  },

  "darkness": {
    "description": "You step backward into the dark… your vision dissolves… your heartbeat slows… something cold grabs your wrist.",
    "commands": {
      "help": {
        "response": "Available commands: scream, run",
        "next": "darkness"
      },
      "scream": {
        "response": "Your scream is swallowed by the void.",
        "next": "death"
      },
      "run": {
        "response": "You stumble forward — back into the hallway.",
        "next": "start"
      }
    },
    "end": "false"
  },

  "death": {
    "description": "A shadow envelops you. Your body freezes. Your vision fades to black.\n\nYou have died.",
    "commands": {
      "help": {
        "response": "There are no commands. You are dead.",
        "next": "death"
      }
    },
    "end": "true"
  },

  "ending": {
    "description": "You crawl through the open hatch and emerge outside into a cold, moonlit forest.\n\nThe facility stands behind you, sirens wailing. Whatever was inside… is no longer your concern.\n\nYou survived.",
    "commands": {
      "help": {
        "response": "There are no commands. You have escaped.",
        "next": "ending"
      }
    },
    "end": "true"
  }
}
